package методы;

public class Main {
//    static   void method(){
//
//    }
//    abstract   void method(){
//        путой методо который не имеет реализации
//    }
//    final  void method(){
//метод не может быть больше переопределен
//    }
//    strictfp   void method(){
//используется при не целочисленных(0,25);считает более точно
//    }
//    //native  void method(){
//используется в библеотеках которые были написаны при использовании джавы,пустые методы
// //   }
//    synchronized   void method(){
//в данный момент времени может выполнять 1 поток
//    }
//
}
